// [Lv.01] 문자열 내 p와 y의 개수

// 문자열 s를 숫자로 변환한 결과를 반환하는 함수, solution을 완성하세요.
// - s의 맨앞에는 부호(+, -)가 올 수 있습니다.
// - s는 부호와 숫자로만 이루어져있습니다.
// - s는 "0"으로 시작하지 않습니다.

// 🤔 내풀이
function solution(s) {
    return parseInt(s);;
}



// ✨ 다른풀이 1
function strToInt(str) {
    return str / 1
    // return  +str;
}
// js가 유연하다는 특성을 살려 암시적 형변환을 한 케이스같다.(Weakly typed language; 약한 타입 언어)
// - int to string →  ""+int
// - string to int →  +string




// 💡 다른풀이를 보고 느낀 점
// - js가 유연하다는 특성을 살린 문제풀이가 많은듯 하다.
//   하지만 개인적으로 이런 특성을 이용하는것도 좋지만 확실하게 형변환을 해주는 편이 더 좋다고 생각한다.

// 💡 내 코드를 다시보고...
// - soso~

// 💡 오늘의 배운 점
// - 오늘의 의문점... 
//   너무 어이없는 문제라 생각해봤는데 아마 ParseInt함수를 알고리즘으로 짜보기를 원하는 듯 하다. 
//   다시 풀어봐야겠다.





// 📝 다시 풀이